# Salary Predictions Based on Job Descriptions

# Part 1 - DEFINE

### ---- 1 Define the problem ----

Write the problem in your own words here

In [4]:
#import your libraries
import pandas as pd
import sklearn as sk
#etc

#your info here
__author__ = "Raktim Barua"
__email__ = "raktim.barua@outlook.co.nz"

## Part 2 - DISCOVER

### ---- 2 Load the data ----

In [6]:
!ls

First Portfolio Project.ipynb
Salary Prediction Interview Assignment.docx
data

In [17]:
#load the data into a Pandas dataframe
salary = pd.read_csv("data/train_salaries.csv")
train_df = pd.read_csv("data/train_features.csv")
salary.head(10)

              jobId  salary
0  JOB1362684407687     130
1  JOB1362684407688     101
2  JOB1362684407689     137
3  JOB1362684407690     142
4  JOB1362684407691     163
5  JOB1362684407692     113
6  JOB1362684407693     178
7  JOB1362684407694      73
8  JOB1362684407695      31
9  JOB1362684407696     104

In [26]:
train_df.head(5)

,jobId,companyId,jobType,degree,major,industry,yearsExperience,milesFromMetropolis
0,JOB1362684407687,COMP37,CFO,MASTERS,MATH,HEALTH,10,83
1,JOB1362684407688,COMP19,CEO,HIGH_SCHOOL,NONE,WEB,3,73
2,JOB1362684407689,COMP52,VICE_PRESIDENT,DOCTORAL,PHYSICS,HEALTH,10,38
3,JOB1362684407690,COMP38,MANAGER,DOCTORAL,CHEMISTRY,AUTO,8,17
4,JOB1362684407691,COMP7,VICE_PRESIDENT,BACHELORS,PHYSICS,FINANCE,8,16

In [39]:
print(salary.shape)
print(train_df.shape)

(1000000, 2)
(1000000, 8)

In [40]:
df = salary.merge(train_df)

In [41]:
df.head()

,jobId,salary,companyId,jobType,degree,major,industry,yearsExperience,milesFromMetropolis
0,JOB1362684407687,130,COMP37,CFO,MASTERS,MATH,HEALTH,10,83
1,JOB1362684407688,101,COMP19,CEO,HIGH_SCHOOL,NONE,WEB,3,73
2,JOB1362684407689,137,COMP52,VICE_PRESIDENT,DOCTORAL,PHYSICS,HEALTH,10,38
3,JOB1362684407690,142,COMP38,MANAGER,DOCTORAL,CHEMISTRY,AUTO,8,17
4,JOB1362684407691,163,COMP7,VICE_PRESIDENT,BACHELORS,PHYSICS,FINANCE,8,16

### ---- 3 Clean the data ----

In [42]:
#look for duplicate data, invalid data (e.g. salaries <=0), or corrupt data and remove it
df.describe()

               salary  yearsExperience  milesFromMetropolis
count  1000000.000000   1000000.000000       1000000.000000
mean       116.061818        11.992386            49.529260
std         38.717936         7.212391            28.877733
min          0.000000         0.000000             0.000000
25%         88.000000         6.000000            25.000000
50%        114.000000        12.000000            50.000000
75%        141.000000        18.000000            75.000000
max        301.000000        24.000000            99.000000

In [43]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1000000 entries, 0 to 999999
Data columns (total 9 columns):
jobId                  1000000 non-null object
salary                 1000000 non-null int64
companyId              1000000 non-null object
jobType                1000000 non-null object
degree                 1000000 non-null object
major                  1000000 non-null object
industry               1000000 non-null object
yearsExperience        1000000 non-null int64
milesFromMetropolis    1000000 non-null int64
dtypes: int64(3), object(6)
memory usage: 76.3+ MB

In [54]:
df_greater_than_zero = df[df['salary'] > 0]

In [56]:
df_greater_than_zero.head()

,jobId,salary,companyId,jobType,degree,major,industry,yearsExperience,milesFromMetropolis
0,JOB1362684407687,130,COMP37,CFO,MASTERS,MATH,HEALTH,10,83
1,JOB1362684407688,101,COMP19,CEO,HIGH_SCHOOL,NONE,WEB,3,73
2,JOB1362684407689,137,COMP52,VICE_PRESIDENT,DOCTORAL,PHYSICS,HEALTH,10,38
3,JOB1362684407690,142,COMP38,MANAGER,DOCTORAL,CHEMISTRY,AUTO,8,17
4,JOB1362684407691,163,COMP7,VICE_PRESIDENT,BACHELORS,PHYSICS,FINANCE,8,16

In [60]:
df_greater_than_zero.columns

Index(['jobId', 'salary', 'companyId', 'jobType', 'degree', 'major',
       'industry', 'yearsExperience', 'milesFromMetropolis'],
      dtype='object')

In [61]:
df_work = df_greater_than_zero.drop(columns=['jobId', 'companyId'])

In [62]:
df_work.shape

(999995, 7)

In [63]:
df_work.head()

,salary,jobType,degree,major,industry,yearsExperience,milesFromMetropolis
0,130,CFO,MASTERS,MATH,HEALTH,10,83
1,101,CEO,HIGH_SCHOOL,NONE,WEB,3,73
2,137,VICE_PRESIDENT,DOCTORAL,PHYSICS,HEALTH,10,38
3,142,MANAGER,DOCTORAL,CHEMISTRY,AUTO,8,17
4,163,VICE_PRESIDENT,BACHELORS,PHYSICS,FINANCE,8,16

In [68]:
import numpy as np
import matplotlib.pyplot as plt

In [ ]:
plt.bar(range(df.shape[0]), np.sort(df['salary'].values))
plt.show()

### ---- 4 Explore the data (EDA) ----

In [3]:
#summarize each feature variable
#summarize the target variable
#look for correlation between each feature and the target
#look for correlation between features

### ---- 5 Establish a baseline ----

In [5]:
#select a reasonable metric (MSE in this case)
#create an extremely simple model and measure its efficacy
#e.g. use "average salary" for each industry as your model and then measure MSE
#during 5-fold cross-validation

### ---- 6 Hypothesize solution ----

In [ ]:
#brainstorm 3 models that you think may improve results over the baseline model based
#on your

Brainstorm 3 models that you think may improve results over the baseline model based on your EDA and explain why they're reasonable solutions here.

Also write down any new features that you think you should try adding to the model based on your EDA, e.g. interaction variables, summary statistics for each group, etc

## Part 3 - DEVELOP

You will cycle through creating features, tuning models, and training/validing models (steps 7-9) until you've reached your efficacy goal

#### Your metric will be MSE and your goal is:
 - <360 for entry-level data science roles
 - <320 for senior data science roles

### ---- 7 Engineer features  ----

In [ ]:
#make sure that data is ready for modeling
#create any new features needed to potentially enhance model

### ---- 8 Create models ----

In [15]:
#create and tune the models that you brainstormed during part 2

### ---- 9 Test models ----

In [1]:
#do 5-fold cross validation on models and measure MSE

### ---- 10 Select best model  ----

In [ ]:
#select the model with the lowest error as your "prodcuction" model

## Part 4 - DEPLOY

### ---- 11 Automate pipeline ----

In [ ]:
#write script that trains model on entire training set, saves model to disk,
#and scores the "test" dataset

### ---- 12 Deploy solution ----

In [16]:
#save your prediction to a csv file or optionally save them as a table in a SQL database
#additionally, you want to save a visualization and summary of your prediction and feature importances
#these visualizations and summaries will be extremely useful to business stakeholders

### ---- 13 Measure efficacy ----

We'll skip this step since we don't have the outcomes for the test data